---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.NoFileSaved
source: html/186f52f3-2410-9ca9-5926-6226a6ad00a6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.NoFileSaved Property

No file has been saved.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoFileSaved { get; }
```